number1 = int(input("Введите первую цифру: "))
number2 = int(input("Введите вторую цифру: "))
number3 = int(input("Введите последнюю цифру: "))
sum = number1+number2+number3 # СОВЕТ: математические операторы лучше обрамлять пробелами, в вашем случае будет: sum = number1 + number2 + number3
multiplication = number1*number2*number3 # СОВЕТ: математические операторы лучше обрамлять пробелами, в вашем случае будет: multiplication = number1 * number2 * number3
print(f"сумма чисел равна {sum} произведение введенных чисел равна {multiplication} ")

# Внимательно читайте задание целиком, нужно было так же скопировать пример ввода и пример вывода, тем не менее в первый раз засчитываю. =)

# Пример ввода:
#     333

# Пример вывода:
#     Сумма цифр = 9
#     Произведение цифр = 27