user_name=input('Введите ваше имя:')  # СОВЕТ: оператор присваивания "=" лучше обрамлять пробелами, в вашем случае будет: user_name = input('Введите ваше имя:')
second_name=input('Введите фамилию:')  # СОВЕТ: оператор присваивания "=" лучше обрамлять пробелами, в вашем случае будет: second_name = input('Введите фамилию:')
user_age=int(input('Введите ваш год рождения:'))  # СОВЕТ: оператор присваивания "=" лучше обрамлять пробелами, в вашем случае будет: user_age = int(input('Введите ваш год рождения:'))
print(second_name,user_name, ",",2024-int(user_age),) # СОВЕТ: когда перечсляете аргументы в функции, после запятой лучше ставить пробел, математические операторы лучше обрамлять пробелами, в вашем случае будет: print(second_name, user_name, ",", 2024 - int(user_age),)

# Внимательно читайте задание целиком, нужно было так же скопировать пример ввода и пример вывода, тем не менее в первый раз засчитываю. =)

# Пример ввода:
#     Введите имя: Иван
#     Введите фамилию: Петров
#     Введите год рождения: 2009

# Пример вывода:
#     Петров Иван, 12